Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/uart.c
/* =============================================================================
 * Private Definitions
 * =============================================================================
 */

/** @brief UART configuration constants */
typedef enum : uint32_t {
  k_uart_default_baudrate      = 115200, /**< Default baud rate: 115200 bps */
  k_uart_bit_time_delay_cycles = 1000,   /**< Bit time delay (~8.68us at 115200 bps, >520 cycles) */
} uart_config_constants_t;

/** @brief SCI register values */
typedef enum : uint8_t {
  k_sci_scr_disabled     = 0x00, /**< SCR: All functions disabled */
  k_sci_scr_tx_enabled   = 0x20, /**< SCR: Transmit enabled (TE=1) */
  k_sci_scr_rx_enabled   = 0x10, /**< SCR: Receive enabled (RE=1) */
  k_sci_scr_txrx_enabled = 0x30, /**< SCR: TX + RX enabled (TE=1, RE=1) */
  k_sci_smr_async_8n1    = 0x00, /**< SMR: Async mode, 8 data bits, no parity, 1 stop bit, PCLK/1 */
  k_sci_semr_default     = 0x00, /**< SEMR: Default extended mode */
  k_sci_ssr_tdre_flag    = 0x80, /**< SSR: Transmit data register empty flag */
  k_sci_ssr_rdrf_flag    = 0x40, /**< SSR: Receive data register full flag */
  k_sci_ssr_orer_flag    = 0x20, /**< SSR: Overrun error flag */
  k_sci_ssr_fer_flag     = 0x10, /**< SSR: Framing error flag */
  k_sci_ssr_per_flag     = 0x08, /**< SSR: Parity error flag */
  k_sci_ssr_error_mask   = 0x38, /**< SSR: All error flags mask */
} sci_register_values_t;

/** @brief Integer to string buffer constants */
typedef enum : uint8_t {
  k_uart_int_buffer_size = 12, /**< Buffer size for int32 to string (enough for -2147483648) */
  k_uart_base_10         = 10, /**< Base 10 for decimal conversion */
} uart_int_constants_t;

/** @brief Hex digit constants */
typedef enum : uint8_t {
  k_uart_hex_max_digits  = 8,    /**< Maximum hex digits to print (32-bit value) */
  k_uart_hex_min_digits  = 1,    /**< Minimum hex digits to print */
  k_uart_hex_zero_digits = 0,    /**< Zero digits value */
  k_uart_hex_nibble_bits = 4,    /**< Bits per hex nibble */
  k_uart_hex_nibble_mask = 0x0F, /**< Mask for hex nibble */
} uart_hex_constants_t;

/** @brief BRR calculation constants */
typedef enum : uint16_t {
  k_brr_divisor_n0     = 32,  /**< Divisor for n=0 (CKS=00): 64 * 2^(2n-1) = 32 */
  k_brr_multiplier     = 4,   /**< Multiplier per CKS increment (2^2) */
  k_brr_max_value      = 255, /**< Maximum BRR register value */
  k_brr_min_value      = 0,   /**< Minimum BRR register value */
  k_brr_formula_offset = 1,   /**< BRR formula subtract-1 offset: BRR = (PCLKB/(32*B)) - 1 */
} brr_constants_t;

/** @brief MSTPCRB register bit manipulation constants */
typedef enum : uint32_t {
  k_uart_mstpcrb_bit_set = 1UL, /**< Single-bit mask for MSTPCRB bit-clear operations */
} uart_mstpcrb_constants_t;

/** @brief Maximum SCI channels (array size, must be enum for compile-time constant) */
typedef enum : uint8_t {
  k_uart_channel_min       = 0,  /**< Minimum UART channel (SCI0) */
  k_uart_array_size        = 13, /**< Array size for s_channel_initialized */
  k_uart_max_mstpb_channel = 11, /**< Maximum channel in MSTPCRB (SCI12 uses MSTPCRC) */
  k_uart_max_channels      = 13, /**< Maximum valid channel value (SCI channels 0-12) */
} uart_internal_constants_t;

typedef enum : uint32_t {
  k_uart_baudrate_min = 1,
  k_uart_baudrate_max = (k_pclkb_hz / k_brr_divisor_n0),
} uart_validation_limits_t;

/** @brief UART timeout constants */
typedef enum : uint32_t {
  k_uart_tx_timeout        = 100000, /**< Transmit buffer wait timeout (prevents infinite loop) */
  k_uart_timeout_expired   = 0,      /**< Timeout counter expired value */
  k_uart_timeout_decrement = 1,      /**< Timeout counter decrement value */
} uart_timeout_t;

/** @brief UART flag comparison constants */
typedef enum : uint8_t {
  k_uart_flag_clear = 0, /**< Flag bit is not set (comparison result) */
} uart_flag_constants_t;

/** @brief UART buffer and string size limits */
typedef enum : uint32_t {
  k_uart_max_str_len = 256, /**< Maximum string length for uart_puts_channel */
} uart_buffer_constants_t;

/** @brief SCI module stop bit positions in MSTPCRB */
typedef enum : uint8_t {
  k_sci_mstpb_sci0  = 31, /**< SCI0 module stop bit */
  k_sci_mstpb_sci1  = 30, /**< SCI1 module stop bit */
  k_sci_mstpb_sci2  = 29, /**< SCI2 module stop bit */
  k_sci_mstpb_sci3  = 28, /**< SCI3 module stop bit */
  k_sci_mstpb_sci4  = 27, /**< SCI4 module stop bit */
  k_sci_mstpb_sci5  = 26, /**< SCI5 module stop bit */
  k_sci_mstpb_sci6  = 25, /**< SCI6 module stop bit */
  k_sci_mstpb_sci7  = 24, /**< SCI7 module stop bit */
  k_sci_mstpb_sci8  = 23, /**< SCI8 module stop bit */
  k_sci_mstpb_sci9  = 22, /**< SCI9 module stop bit */
  k_sci_mstpb_sci10 = 21, /**< SCI10 module stop bit */
  k_sci_mstpb_sci11 = 20, /**< SCI11 module stop bit */
} sci_mstpb_bits_t;

/** @brief Debug UART pins (SCI9 on RX72N) */
typedef enum : uint16_t {
  k_uart_debug_tx_gpio = k_rx_pb_7, /**< PB7 = TXD9 */
  k_uart_debug_rx_gpio = k_rx_pb_6, /**< PB6 = RXD9 */
} uart_debug_pins_t;

/** @brief GPIO register bit manipulation constant */
typedef enum : uint8_t {
  k_uart_gpio_bit_set = 1,
} uart_gpio_constants_t;

/* =============================================================================
 * Private State
 * =============================================================================
 */

/** @brief Per-channel initialization state */
static bool s_channel_initialized[k_uart_array_size] = {false};

/* =============================================================================
 * Private Functions
 * =============================================================================
 */

/**
 * @brief Calculate BRR value for given baud rate
 *
 * BRR = (PCLKB / (64 * 2^(2n-1) * B)) - 1
 * For n=0 (CKS=00, PCLK/1): BRR = (PCLKB / (32 * B)) - 1
 *
 * @param[in] baudrate Target baud rate
 * @return BRR register value
 */
static uint8_t internal_calculate_brr(const uint32_t baudrate)
{
  if (baudrate == 0) {
    return k_brr_max_value;
  }

  /* For n=0 (CKS=00): BRR = (PCLKB / (32 * B)) - 1 */
  const uint32_t brr_value = (k_pclkb_hz / (k_brr_divisor_n0 * baudrate)) - k_brr_formula_offset;

  if (brr_value > k_brr_max_value) {
    return k_brr_max_value;
  }

  return (uint8_t)brr_value;
}

/**
 * @brief Clear error flags in SSR register
 *
 * @param[in] sci Pointer to SCI registers
 */
static void internal_clear_errors(volatile rx_sci_regs_t* sci)
{
  /* Pre-condition: Validate pointer (NASA Power of 10 Rule 5) */
  if (sci == nullptr) {
    return;
  }

  volatile uint8_t ssr = 0;

  /* Read SSR then clear error flags */
  ssr = sci->ssr;
  (void)ssr; /* Suppress unused variable warning */
  sci->ssr = (uint8_t)(ssr & ~k_sci_ssr_error_mask);
}

/**
 * @brief Get MSTPCRB bit position for SCI channel
 *
 * @param[in] channel SCI channel (0-11)
 *
 * @return Bit position in MSTPCRB, or -1 if invalid channel
 */
static int8_t internal_get_mstpb_bit(const uint8_t channel)
{
  /* SCI12 is in MSTPCRC, not supported here */
  if (channel > k_uart_max_mstpb_channel) {
    return -1;
  }

  /* MSTPCRB bits: SCI0=31, SCI1=30, ..., SCI11=20 */
  return (int8_t)(k_sci_mstpb_sci0 - channel);
}

/**
 * @brief Enable SCI module clock (clear module stop)
 *
 * @param[in] channel SCI channel (0-11)
 *
 * @return k_rx_ok on success, k_rx_err_invalid_arg if channel invalid
 */
static rx_err_t internal_enable_sci_clock(const uint8_t channel)
{
  const int8_t mstpb_bit = internal_get_mstpb_bit(channel);

  if (mstpb_bit < 0) {
    return k_rx_err_invalid_arg;
  }

  /* Unlock protection */
  *prcr_reg() = k_rx_prcr_unlock_all;

  /* Clear module stop bit to enable clock */
  system_regs()->mstpcrb &= ~(k_uart_mstpcrb_bit_set << (uint8_t)mstpb_bit);

  /* Lock protection */
  *prcr_reg() = k_rx_prcr_lock;

