Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/uart.c
  return k_rx_ok;
}

/**
 * @brief Configure pins for SCI UART operation
 *
 * Sets up MPC (pin mux) and GPIO registers for TX/RX pins.
 *
 * @param[in] tx_gpio TX pin (rx_port_pin_t from rx_port_constants.h)
 * @param[in] rx_gpio RX pin (rx_port_pin_t from rx_port_constants.h)
 *
 * @return k_rx_ok on success, error code on failure
 */
static rx_err_t internal_configure_uart_pins(const rx_port_pin_t tx_gpio, rx_port_pin_t rx_gpio)
{
  /* Extract port and pin numbers for hardware register access */
  const uint8_t tx_port = rx_port_from_pin(tx_gpio);
  const uint8_t tx_pin  = rx_pin_from_pin(tx_gpio);
  const uint8_t rx_port = rx_port_from_pin(rx_gpio);
  const uint8_t rx_pin  = rx_pin_from_pin(rx_gpio);

  /* Validate pin numbers (lower bound checks omitted - pins are uint8_t, k_rx_pin_min == 0,
   * so pin >= k_rx_pin_min is always true, avoiding -Wtype-limits warning) */
  if (tx_pin > k_rx_pin_max || rx_pin > k_rx_pin_max) {
    return k_rx_err_invalid_arg;
  }

  /* Get port bases */
  volatile rx_port_regs_t* tx_port_base = rx_port_get_base(tx_port);
  volatile rx_port_regs_t* rx_port_base = rx_port_get_base(rx_port);

  if (tx_port_base == nullptr || rx_port_base == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Configure MPC for SCI function */
  rx_err_t err = rx_mpc_set_sci(tx_gpio);
  if (err != k_rx_ok) {
    return err;
  }

  err = rx_mpc_set_sci(rx_gpio);
  if (err != k_rx_ok) {
    return err;
  }

  /* Configure TX pin: output direction, peripheral mode */
  const uint8_t tx_pin_mask = (uint8_t)(k_uart_gpio_bit_set << tx_pin);
  const uint8_t rx_pin_mask = (uint8_t)(k_uart_gpio_bit_set << rx_pin);

  tx_port_base->pdr |= tx_pin_mask; /* Output */
  tx_port_base->pmr |= tx_pin_mask; /* Peripheral mode */

  /* Configure RX pin: input direction, peripheral mode */
  rx_port_base->pdr &= (uint8_t)~rx_pin_mask; /* Input */
  rx_port_base->pmr |= rx_pin_mask;           /* Peripheral mode */

  return k_rx_ok;
}

/* =============================================================================
 * Multi-Channel UART Functions
 * =============================================================================
 */

/**
 * @brief Initialize UART channel with specified configuration
 *
 * @details
 * Configures and enables an SCI peripheral for asynchronous UART operation.
 * Handles module clock enable, pin mux configuration, and SCI register setup.
 *
 * **Algorithm steps:**
 * 1. Validate configuration parameters (NULL check, channel range, baud rate)
 * 2. Get SCI register base address for channel
 * 3. Check if channel is already initialized (prevent double-init)
 * 4. Enable SCI module clock (clear MSTPB bit)
 * 5. Configure TX/RX pins via MPC and GPIO registers
 * 6. Disable TX/RX during configuration (SCR = 0)
 * 7. Set serial mode: async, 8N1, PCLK/1 (SMR)
 * 8. Calculate and set baud rate divisor (BRR)
 * 9. Wait for 1 bit time (synchronization)
 * 10. Enable TX and RX (SCR = 0x30)
 * 11. Mark channel as initialized
 *
 * @dot
 * digraph uart_init {
 *   rankdir=TB;
 *   node [shape=box, style=rounded];
 *
 *   start [label="Start"];
 *   validate [label="Validate config"];
 *   check_init [label="Already initialized?", shape=diamond];
 *   enable_clk [label="Enable SCI clock"];
 *   config_pins [label="Configure TX/RX pins"];
 *   disable_txrx [label="Disable TX/RX"];
 *   set_mode [label="Set async 8N1 mode"];
 *   set_baud [label="Set BRR for baud rate"];
 *   wait [label="Wait 1 bit time"];
 *   enable_txrx [label="Enable TX + RX"];
 *   mark_init [label="Mark initialized"];
 *   success [label="Return k_rx_ok", fillcolor=lightgreen, style="rounded,filled"];
 *   error [label="Return error", fillcolor=lightcoral, style="rounded,filled"];
 *
 *   start -> validate;
 *   validate -> error [label="invalid"];
 *   validate -> check_init [label="valid"];
 *   check_init -> error [label="yes"];
 *   check_init -> enable_clk [label="no"];
 *   enable_clk -> config_pins;
 *   config_pins -> error [label="fail"];
 *   config_pins -> disable_txrx [label="ok"];
 *   disable_txrx -> set_mode;
 *   set_mode -> set_baud;
 *   set_baud -> wait;
 *   wait -> enable_txrx;
 *   enable_txrx -> mark_init;
 *   mark_init -> success;
 * }
 * @enddot
 *
 * @param[in] config Pointer to channel configuration structure.
 *   - **channel**: SCI channel (0-12)
 *   - **baudrate**: Target baud rate (1 to PCLKB/32)
 *   - **tx_gpio**: TX pin (rx_port_pin_t)
 *   - **rx_gpio**: RX pin (rx_port_pin_t)
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success, channel initialized and ready
 * @retval k_rx_err_null_ptr config parameter is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel (≥13) or invalid baud rate
 * @retval k_rx_err_invalid_state Channel already initialized
 *
 * @pre config must point to valid uart_channel_config_t structure
 * @pre config->channel must be in range [0, 12]
 * @pre config->baudrate must be in valid range for PCLKB
 * @pre Channel must not be already initialized
 *
 * @post Channel configured for 8N1 async operation
 * @post TX and RX enabled and ready for use
 * @post s_channel_initialized[channel] set to true
 * @post TX/RX pins configured for peripheral function
 *
 * @note Not thread-safe - call once during initialization
 * @note Includes ~1ms delay for baud rate synchronization
 * @warning Does not validate pin assignments against hardware
 *
 * @par Thread Safety:
 * Not thread-safe. Call once per channel during system initialization.
 *
 * @par Performance:
 * - Execution time: ~50 µs (includes MPC and delay)
 * - Stack usage: 48 bytes
 *
 * @par Example:
 * @code{.c}
 * const uart_channel_config_t config = {
 *   .channel  = k_uart_channel_9,
 *   .baudrate = 115200,
 *   .tx_gpio  = k_rx_pb_7,
 *   .rx_gpio  = k_rx_pb_6,
 * };
 *
 * rx_err_t err = uart_init_channel(&config);
 * if (err != k_rx_ok) {
 *   // Handle error
 * }
 * @endcode
 *
 * @see uart_deinit_channel() Deinitialize channel
 * @see uart_putc_channel() Transmit single character
 * @see uart_channel_config_t Configuration structure
 *
 * @since Version 1.0.0
 */
rx_err_t uart_init_channel(const uart_channel_config_t* config)
{
  /* Validate config pointer */
  if (config == nullptr) {
    return k_rx_err_null_ptr;
  }

