Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/uart.c
  return k_rx_ok;
}

/**
 * @brief Transmit null-terminated string on UART channel with newline conversion
 *
 * @details
 * Transmits a null-terminated string with automatic LF to CR+LF conversion for
 * terminal compatibility. Enforces maximum string length (k_uart_max_str_len = 256)
 * to comply with NASA Power of 10 Rule 2 (bounded loops).
 *
 * **Algorithm steps:**
 * 1. Validate string pointer (NULL check)
 * 2. Validate channel number and initialization state
 * 3. For each character up to k_uart_max_str_len:
 *    a. Check for null terminator (success exit)
 *    b. If '\n', send '\r' first (CR+LF conversion)
 *    c. Transmit character via uart_putc_channel()
 *    d. Propagate any errors immediately
 * 4. If limit reached without terminator, return k_rx_err_invalid_size
 *
 * **Newline conversion:**
 * - Input '\n' (LF) -> Output '\r\n' (CR+LF)
 * - Required for Windows terminals (e.g., PuTTY, TeraTerm)
 * - Ensures cursor returns to column 0 before line feed
 *
 * @param[in] channel UART channel to use (0-12)
 *   - **Valid range**: 0 to 12 (SCI0 through SCI12)
 *
 * @param[in] str Pointer to null-terminated string
 *   - **Valid range**: Non-nullptr to valid memory
 *   - **Maximum length**: 256 characters (k_uart_max_str_len)
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *   - **Encoding**: ASCII (extended characters passed through)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success, entire string transmitted
 * @retval k_rx_err_null_ptr str parameter is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel number
 * @retval k_rx_err_invalid_state Channel not initialized
 * @retval k_rx_err_invalid_size String exceeds 256 characters
 * @retval k_rx_err_timeout Hardware timeout during transmission
 *
 * @pre Channel must be initialized via uart_init_channel()
 * @pre str must point to null-terminated string in valid memory
 *
 * @post All characters transmitted including converted newlines
 * @post On error, partial string may have been transmitted
 *
 * @note Blocking call - waits for each character to transmit
 * @note String length limited to 256 characters for safety
 * @warning Long strings may take significant time (256 chars ≈ 22ms @ 115200)
 *
 * @par Thread Safety:
 * Thread-safe for different channels. Not safe for same channel without mutex.
 *
 * @par Performance:
 * - Execution time: ~90 µs per character @ 115200 baud
 * - Stack usage: 24 bytes
 * - Example: 100-char string ≈ 9 ms
 *
 * @par Example:
 * @code{.c}
 * // Simple string
 * uart_puts_channel(k_uart_channel_9, "Hello, World!\n");
 * // Output: "Hello, World!\r\n"
 *
 * // Multiple lines
 * uart_puts_channel(k_uart_channel_9, "Line 1\nLine 2\nLine 3\n");
 * // Output: "Line 1\r\nLine 2\r\nLine 3\r\n"
 *
 * // Error handling
 * rx_err_t err = uart_puts_channel(k_uart_channel_9, msg);
 * if (err != k_rx_ok) {
 *   // Partial transmission may have occurred
 * }
 * @endcode
 *
 * @see uart_putc_channel() Transmit single character
 * @see uart_write_channel() Transmit binary data (no conversion)
 * @see uart_debug_puts() Simplified debug wrapper
 *
 * @since Version 1.0.0
 */
rx_err_t uart_puts_channel(const uart_channel_t channel, const char* str)
{
  /* Validate parameters */
  if (str == nullptr) {
    return k_rx_err_null_ptr;
  }

  if ((uint8_t)channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  if (!s_channel_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  /* Transmit string with \n to \r\n conversion (statically bounded) */
  for (uint32_t i = 0; i < k_uart_max_str_len; ++i) {
    if (str[i] == '\0') {
      return k_rx_ok; /* Terminator found, success */
    }
    if (str[i] == '\n') {
      const rx_err_t err = uart_putc_channel(channel, '\r');
      if (err != k_rx_ok) {
        return err;
      }
    }
    const rx_err_t err = uart_putc_channel(channel, str[i]);
    if (err != k_rx_ok) {
      return err;
    }
  }

  /* Reached limit without finding terminator */
  return k_rx_err_invalid_size;
}

/**
 * @brief Write binary data to UART channel without newline conversion
 *
 * @details
 * Transmits a block of raw bytes on the specified SCI channel using
 * uart_putc_channel() for each byte. No LF-to-CR+LF conversion is performed,
 * making this function suitable for binary protocol data.
 *
 * **Algorithm steps:**
 * 1. Validate data pointer (NULL check)
 * 2. Validate channel number and initialization state
 * 3. For each byte in [0, length): call uart_putc_channel() and propagate errors
 *
 * @param[in] channel UART channel to use (0-12)
 *   - **Valid range**: 0 to 12 (SCI0 through SCI12)
 *
 * @param[in] data Pointer to buffer containing bytes to transmit
 *   - **Valid range**: Non-nullptr pointing to at least `length` bytes
 *   - **Null handling**: Returns k_rx_err_null_ptr if nullptr
 *
 * @param[in] length Number of bytes to write
 *   - **Valid range**: 0 to UINT16_MAX; 0 returns k_rx_ok immediately
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success, all bytes transmitted
 * @retval k_rx_err_null_ptr data parameter is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel number
 * @retval k_rx_err_invalid_state Channel not initialized
 * @retval k_rx_err_timeout Hardware timeout during transmission
 *
 * @pre Channel must be initialized via uart_init_channel()
 * @pre data must point to at least `length` bytes of valid memory
 *
 * @post All `length` bytes transmitted in order
 * @post On error, partial data may have been transmitted
 *
 * @note Blocking call - waits for each byte to be accepted by TDR
 * @note No newline conversion - use uart_puts_channel() for text output
 *
 * @par Thread Safety:
 * Thread-safe for different channels. Not safe for same channel without mutex.
 *
 * @par Performance:
 * - Execution time: ~90 µs per byte @ 115200 baud
 * - Stack usage: 24 bytes
 *
 * @par Example:
 * @code{.c}
 * const uint8_t frame[] = {0xAA, 0x55, 0x01, 0x02, 0x03};
 * rx_err_t err = uart_write_channel(k_uart_channel_9, frame, sizeof(frame));
 * if (err != k_rx_ok) {
 *   // Handle partial write
 * }
 * @endcode
 *
 * @see uart_puts_channel() Transmit text string with newline conversion
 * @see uart_read_channel() Read binary data
 *
 * @since Version 1.0.0
 */
rx_err_t uart_write_channel(const uart_channel_t channel, const uint8_t* data, uint16_t length)
{
  /* Validate parameters */
  if (data == nullptr) {
    return k_rx_err_null_ptr;
  }

  if ((uint8_t)channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  if (!s_channel_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

