Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/uart.c
  /* Add minus sign if negative */
  if (is_negative && p > buffer) {
    *(--p) = '-';
  }

  /* Transmit the string */
  uart_debug_puts(p);
}

/**
 * @brief Transmit 32-bit unsigned integer as hexadecimal string on debug UART
 *
 * @details
 * Transmits "0x" prefix followed by the specified number of uppercase hex
 * digits of `value` on SCI9. Digits are always printed most-significant first.
 * The `digits` parameter is clamped to [k_uart_hex_min_digits, k_uart_hex_max_digits]
 * (1-8) before use.
 *
 * **Algorithm steps:**
 * 1. Send "0x" prefix via uart_debug_puts()
 * 2. Clamp digits to [1, 8]
 * 3. Iterate nibbles from MSN to LSN (statically bounded by k_uart_hex_max_digits)
 * 4. For each nibble index < digits, extract nibble and print uppercase hex char
 *
 * @param[in] value  Unsigned 32-bit value to display in hexadecimal
 *   - **Valid range**: 0x00000000 to 0xFFFFFFFF
 *
 * @param[in] digits Number of hex digits to print (1-8)
 *   - **Valid range**: 1 to 8 (clamped; 0 -> 1, >8 -> 8)
 *   - **Common values**: 2 for byte, 4 for word, 8 for full 32-bit
 *
 * @pre uart_debug_init() must have been called successfully
 * @pre uart_debug_puts() and uart_debug_putc() must be functional
 *
 * @post "0x" followed by `digits` uppercase hex characters transmitted on SCI9
 * @post digits clamped to [1, 8] if out of range
 *
 * @note Uses static lookup table s_hex[] for digit-to-character conversion
 * @note Always prefixes output with "0x"
 * @warning Only available when RX_IS_SIMULATOR is 0 (hardware builds)
 *
 * @par Thread Safety:
 * Not safe for concurrent access on SCI9 without external mutex.
 *
 * @par Performance:
 * - Execution time: ~90 µs per character @ 115200 baud
 * - Stack usage: 24 bytes
 *
 * @par Example:
 * @code{.c}
 * uart_debug_puts("Addr: ");
 * uart_debug_puthex(0xDEADBEEF, 8);  // Sends "0xDEADBEEF"
 * uart_debug_puthex(0x42, 2);        // Sends "0x42"
 * uart_debug_putc('\n');
 * @endcode
 *
 * @see uart_debug_putint() Print signed decimal value
 * @see uart_debug_puts() Underlying string transmit
 *
 * @since Version 1.0.0
 */
void uart_debug_puthex(const uint32_t value, uint8_t digits)
{
  static const char s_hex[] = "0123456789ABCDEF";
  int32_t           i;
  uint8_t           nibble;

  uart_debug_puts("0x");

  /* Clamp digits to valid range */
  if (digits > k_uart_hex_max_digits) {
    digits = k_uart_hex_max_digits;
  }
  if (digits == k_uart_hex_zero_digits) {
    digits = k_uart_hex_min_digits;
  }

  /* Print hex digits from most significant (statically bounded) */
  for (i = k_uart_hex_max_digits - 1; i >= 0; i--) {
    if (i < digits) {
      nibble = (value >> (i * k_uart_hex_nibble_bits)) & k_uart_hex_nibble_mask;
      uart_debug_putc(s_hex[nibble]);
    }
  }
}

#endif /* !RX_IS_SIMULATOR */
